Enums/КК_СтатусыИнтернетЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КК_СтатусыИнтернетЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/КК_ФормаМойКабинет/Ext/Form/Module.bsl
&НаСервереПроцедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		ЗаполнитьДанныеКонтрагента();	КонецПроцедуры&НаСервереФункция КК_ПолучитьКонтрагентаПользователя()	Запрос = Новый Запрос;	Запрос.Текст =	"ВЫБРАТЬ	|	Пользователи.КК_Контрагент КАК Контрагент	|ИЗ	|	Справочник.Пользователи КАК Пользователи	|ГДЕ	|	Пользователи.ИдентификаторПользователяИБ = &Ид";	Запрос.УстановитьПараметр("Ид",		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	Выборка = Запрос.Выполнить().Выбрать();	Если Выборка.Следующий() Тогда		Возврат Выборка.Контрагент;	КонецЕсли;	Возврат Неопределено;КонецФункции&НаСервереПроцедура ЗаполнитьДанныеКонтрагента()		ТекКонтрагент = КК_ПолучитьКонтрагентаПользователя();		Если НЕ ЗначениеЗаполнено(ТекКонтрагент) Тогда		Контрагент = "Гость";		Возврат;	КонецЕсли;		ТекКонтрагентСсылка = ТекКонтрагент;	Контрагент = ТекКонтрагент.Наименование;		Запрос = Новый Запрос;	Запрос.Текст = 	"ВЫБРАТЬ	|	КОЛИЧЕСТВО(Заказ.Ссылка) КАК ВсегоЗаказов,	|	СУММА(ВЫБОР	|		КОГДА Заказ.КК_СтатусИнтернетЗаказа = ЗНАЧЕНИЕ(Перечисление.КК_СтатусыИнтернетЗаказа.ОжидаетОплаты)	|		ТОГДА Заказ.СуммаДокумента	|		ИНАЧЕ 0	|	КОНЕЦ) КАК СуммаОжидаетОплаты,	|	СУММА(ВЫБОР	|		КОГДА Заказ.КК_СтатусИнтернетЗаказа В (	|			ЗНАЧЕНИЕ(Перечисление.КК_СтатусыИнтернетЗаказа.ВОбработке),	|			ЗНАЧЕНИЕ(Перечисление.КК_СтатусыИнтернетЗаказа.ОжидаетОплаты),	|			ЗНАЧЕНИЕ(Перечисление.КК_СтатусыИнтернетЗаказа.Исполняется),	|			ЗНАЧЕНИЕ(Перечисление.КК_СтатусыИнтернетЗаказа.Выполнен))	|		ТОГДА 1	|		ИНАЧЕ 0	|	КОНЕЦ) КАК ВРаботе	|ИЗ	|	Документ.ЗаказПокупателя КАК Заказ	|ГДЕ	|	Заказ.Контрагент = &Контрагент	|	И Заказ.КК_ИнтернетЗаказ = ИСТИНА	|	И Заказ.Проведен = ИСТИНА";		Запрос.УстановитьПараметр("Контрагент", ТекКонтрагент);		Результат = Запрос.Выполнить().Выгрузить();		Если Результат.Количество() > 0 Тогда		Строка = Результат[0];		ВсегоЗаказов  = ?(Строка.ВсегоЗаказов  = NULL, 0, Строка.ВсегоЗаказов);		ОжидаетОплаты = ?(Строка.СуммаОжидаетОплаты = NULL, 0, Строка.СуммаОжидаетОплаты);		ВРаботе       = ?(Строка.ВРаботе = NULL, 0, Строка.ВРаботе);	КонецЕсли;	КонецПроцедуры
